## Hello, world! 출력
print 함수로 Hello, world!를 출력합니다.

In [4]:
print('hello world!')

hello world!

In [5]:
import pandas as pd

In [6]:
df1 = pd.DataFrame([[3,2,5], [10,0,2], [6,5,3]],
                  columns=["사과", "자두", "포도"],
                    index=["이성계", "김유신", "이순신"])
s1 = df1["사과"]

In [7]:
df1

     사과  자두  포도
이성계   3   2   5
김유신  10   0   2
이순신   6   5   3

In [9]:
s1

이성계     3
김유신    10
이순신     6
Name: 사과, dtype: int64

In [18]:
df1.sum()

사과    19
자두     7
포도    10
dtype: int64

In [19]:
df1.mean()

사과    6.333333
자두    2.333333
포도    3.333333
dtype: float64

In [21]:
df1.values

array([[ 3,  2,  5],
       [10,  0,  2],
       [ 6,  5,  3]], dtype=int64)

In [22]:
df1.index

Index(['이성계', '김유신', '이순신'], dtype='object')

In [24]:
df1.columns

Index(['사과', '자두', '포도'], dtype='object')

In [26]:
df1.values > 3

array([[False, False,  True],
       [ True, False, False],
       [ True,  True, False]])

In [27]:
df1 > 3

        사과     자두     포도
이성계  False  False   True
김유신   True  False  False
이순신   True   True  False

In [28]:
s1 > 3

이성계    False
김유신     True
이순신     True
Name: 사과, dtype: bool

In [10]:
pd.read_excel("E00EXAMPLE.xlsx")

    이름  국어  영어  수학  과학
0  강동원  63  93  67  71
1  송중기  89  83  71  80
2  기태영  83  76  92  98
3  김남길  94  88  73  93
4  류준열  71  83  80  88
5  박성균  67  87  92  90

In [11]:
pd.read_excel("E00EXAMPLE.xlsx").set_index("이름")

     국어  영어  수학  과학
이름
강동원  63  93  67  71
송중기  89  83  71  80
기태영  83  76  92  98
김남길  94  88  73  93
류준열  71  83  80  88
박성균  67  87  92  90

In [4]:
pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], index=["이성계", "김유신", "이순신"])

     0  1  2
이성계  1  2  3
김유신  4  5  6
이순신  7  8  9

In [3]:
pd.Series([1,2,4], index=["이성계", "김유신", "이순신"])

이성계    1
김유신    2
이순신    4
dtype: int64